cases/dropletSplash_Yokoi2009/0.orig/fluid/alpha.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
  faceWall
  {
      type            dynamicAlphaContactAngleYokoi;
	  theta0		  90;
	  thetaA		  114;
	  thetaR 		  52;
	  ka			  9.0e-9;
	  kr			  9.0e-8;
	  limit			  gradient;
	  value		 	  uniform 1;  
  }

  outlet
  {
      type            zeroGradient;
  }

  front
  {
      type            wedge;
  }

  back
  {
      type            wedge;
  }
}

// ************************************************************************* //
