cases/dropletSplash_Yokoi2009/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interBoilingFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.03;

deltaT          1E-8;

writeControl    adjustableRunTime;
writeInterval   0.001;

/*writeControl timeStep;*/
/*writeInterval 40;*/

purgeWrite      0;

writeFormat     binary;

writePrecision  8;

writeCompression on;

timeFormat      general;

timePrecision   10;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.25;
maxAlphaCo      0.25;

maxDeltaT       1e-6;

libs
(
"libdynContactAngleModels.so"
);

// ************************************************************************* //
